Tasks/ПринятьТЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>ПринятьТЗ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайняяДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланРазработкиВДнях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектТЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Comment>1 принят, 2 отказ, 0 Ожидание, -1 новый</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКомментария</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комплекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВыгруженВPDM</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комплект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Конструктор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланРазработкиВДнях</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Наблюдатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наблюдатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЧекЛистКонструктора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

InformationRegisters/ПлановоеЗначениеПроектирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПлановоеЗначениеПроектирования</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончанияВКалендарных</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончанияВРабочих</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланРазработкиВДнях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Задачи_ПКД</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи_РКД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГлабольныеСостояниеКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ГлабольныеСостояниеКомплекта</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГлобальныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗадачаДляБлокировки</Name>
					<Type>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущаяСтадия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийСостояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтадияПроизводства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтадияТЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзделиеЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияЗаказчика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДанныеКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКомплекта</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоПроектирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеПроектирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяПродолжительностьПроизводства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСогласований</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтадия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтадияПроизводства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Tasks/ПринятьТЗ/Forms/ФормаЗадачи/Ext/Form/Module.bsl
//Статус 1 принят, 2 отказ, 0 Ожидание, -1 новый
&НаКлиенте                     
Перем ПолноеИмяФайла, ПланРазработкиВДняхКомплектов;

&НаКлиенте                     
Процедура Принять(Команда)
	
	Если НЕ КонтрольКонструкторов() Тогда
	    Возврат;
	КонецЕсли;
	
	Если Объект.ПланРазработкиВДнях = 0 Тогда
		
		ПоказатьПредупреждение(, "Не заполнено плановое время");
	    Возврат;
		
	КонецЕсли;
	
	Для каждого х Из Объект.Комплекты Цикл
	
		Если х.ПланРазработкиВДнях = 0  Тогда
			
			ПоказатьПредупреждение(, "Не заполнено плановое время у комплекта " + х.Комплект);
			Возврат;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Объект.Выполнена 	= Истина;
	Объект.Статус 		= 1;
	Записать();
	
	ИзменитьСтатусНаСервере(Объект.Статус, Объект.ОбъектТЗ, Объект.Комментарий);
	
	КоличествоЗадач = СоздатьЗадачиПКД();
	
	Закрыть();
	
КонецПроцедуры

Функция СоздатьЗадачиПКД()
	
	ТДНД = НачалоДня(ТекущаяДата());

	ТипыВнешнегоПроизводства = омВнешнееПроизводство.ТипВнешнегоПроизводства(Объект.ОбъектТЗ);
	
	Если НЕ ТипыВнешнегоПроизводства.ПКД Тогда
		
		тзКомплекты = Объект.Комплекты.Выгрузить();
		
		мКомплекты = тзКомплекты.ВыгрузитьКолонку("Комплект");
		мКомплекты.Добавить(Объект.ОбъектТЗ);
		
		мКонструкторы = тзКомплекты.ВыгрузитьКолонку("Конструктор");
		мКонструкторы.Добавить(КонструкторКомпозиции);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Задачи_ПКД.ОбъектТЗ КАК ОбъектТЗ
			|ИЗ
			|	Задача.Задачи_ПКД КАК Задачи_ПКД
			|ГДЕ
			|	Задачи_ПКД.ОбъектТЗ В(&ОбъектТЗ)
			|	И Задачи_ПКД.Основание = &Основание
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(Пользователи.Ссылка, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Пользователи,
			|	Сотрудники.Ссылка КАК Сотрудники
			|ИЗ
			|	Справочник.Сотрудники КАК Сотрудники
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
			|		ПО (Пользователи.Сотрудник = Сотрудники.Ссылка)
			|ГДЕ
			|	Сотрудники.Ссылка В(&мКонструкторы)";
		
		Запрос.УстановитьПараметр("Основание", 		Объект.Ссылка);
		Запрос.УстановитьПараметр("ОбъектТЗ", 		мКомплекты);
		Запрос.УстановитьПараметр("мКонструкторы", 	мКонструкторы);
		
		Результат = Запрос.ВыполнитьПакет();
		
		мСуществующиеЗадачи 	= Результат[0].Выгрузить().ВыгрузитьКолонку("ОбъектТЗ");
		
		тзСотрудникПользователь = Результат[1].Выгрузить();
		
		стПараметры = омЗадачиПКДСервер.ПолучитьСтркутуркДляСозданияПКД(Объект.ОбъектТЗ, Объект.Проект);
		
		КомплектыКоличество = 0;
		
		Если мСуществующиеЗадачи.Найти(Объект.ОбъектТЗ) = Неопределено Тогда
			
			ПользовательКонструкторЭлемент = тзСотрудникПользователь.Найти(КонструкторКомпозиции, "Сотрудники");
			
			Если ПользовательКонструкторЭлемент = Неопределено Тогда
				ПользовательКонструктор = Справочники.Пользователи.ПустаяСсылка();	
			Иначе	
				ПользовательКонструктор = ПользовательКонструкторЭлемент.Пользователи;	
			КонецЕсли;
			
			НоваяЗадача = омЗадачиПКДСервер.СоздатьЗадачуПКД(Объект.ОбъектТЗ, ПользовательКонструктор, стПараметры, Объект.Ссылка);
			КомплектыКоличество = КомплектыКоличество + 1; 
			
			РегистрыСведений.ПлановоеЗначениеПроектирования.ЗаписатьПлановоеЗначениеЗадачи(НоваяЗадача, ТДНД, Объект.ПланРазработкиВДнях, ,Объект.Дата); 
			
		КонецЕсли;
		
		Для каждого х Из Объект.Комплекты Цикл
			
			Если НЕ мСуществующиеЗадачи.Найти(х.Комплект) = Неопределено Тогда
				Возврат Ложь;	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(стПараметры.Композиция) И КонструкторКомпозиции = х.Конструктор Тогда
				стПараметры.ОбобщеннаяЗадача	= Истина;
			Иначе
				стПараметры.ОбобщеннаяЗадача	= Ложь;
			КонецЕсли;
			
			ПользовательКонструкторЭлемент = тзСотрудникПользователь.Найти(х.Конструктор, "Сотрудники");
			
			Если ПользовательКонструкторЭлемент = Неопределено Тогда
				ПользовательКонструктор = Справочники.Пользователи.ПустаяСсылка();	
			Иначе	
				ПользовательКонструктор = ПользовательКонструкторЭлемент.Пользователи;	
			КонецЕсли;
			
			НоваяЗадача = омЗадачиПКДСервер.СоздатьЗадачуПКД(х.Комплект, ПользовательКонструкторЭлемент, стПараметры, Объект.Ссылка); 
			КомплектыКоличество = КомплектыКоличество + 1; 

			РегистрыСведений.ПлановоеЗначениеПроектирования.ЗаписатьПлановоеЗначениеЗадачи(НоваяЗадача, ТДНД, х.ПланРазработкиВДнях, , Объект.Дата); 
			
		КонецЦикла;
		
	ИначеЕсли ЗначениеЗаполнено(ТипыВнешнегоПроизводства.ЗадачаВнешнегоПроизводства) Тогда
		КомплектыКоличество = 0;	
	Иначе
		КомплектыКоличество = 0;
		омВнешнееПроизводство.СоздатьЗадачуВнешнегоПроизводства(Объект.ОбъектТЗ, Объект.Проект, , , Истина);
	КонецЕсли;
	
	
	Возврат КомплектыКоличество;
	
КонецФункции

&НаКлиенте
Функция КонтрольКонструкторов()
	
	Если НЕ ВыгруженВPDM Тогда
		ПоказатьПредупреждение(, Строка(Объект.ОбъектТЗ) + " нет выгрузки в PDM.");
		Возврат Ложь;
	КонецЕсли;
	
	Для каждого х Из Объект.Комплекты Цикл
		
		Если НЕ х.ВыгруженВPDM Тогда
			ПоказатьПредупреждение(, "Комплект " + Строка(х.Комплект) + " не выгружен в PDM.");
			Возврат Ложь;
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // КонтрольКонструкторов()

&НаКлиенте
Процедура Отказать(Команда)
	Если ПустаяСтрока(Объект.Комментарий) Тогда
		
		ПоказатьПредупреждение(, "Для отказа необходимо заполнить комментарий");	
		
	Иначе
		
		Объект.Выполнена = Истина;
		Объект.Статус = 2;
		Записать();
		
		ИзменитьСтатусНаСервере(Объект.Статус, Объект.ОбъектТЗ ,Объект.Комментарий);
		
		Закрыть();

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТЗ(Команда)
	
	ЗапуститьПриложение(ПутьКФайлуТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписанФайлТЗ" Тогда
		
		Если ПустаяСтрока(Параметр.ПолноеИмяФайла) Тогда
			ПоказатьПредупреждение(, "Не удалось получить файл ТЗ");
		ИначеЕсли Параметр.ПараметрыСохранения = "Открыть" Тогда
			ЗапуститьПриложение(Параметр.ПолноеИмяФайла);
		ИначеЕсли Параметр.ПараметрыСохранения = "Выгрузить" Тогда
			
			стПараметры = Новый Структура("ПолноеИмяФайла", Параметр.ПолноеИмяФайла);
			
			Результат = омВыгрузкаCRMНаКлиенте.ВыгрузитьВPDM(Объект.ОбъектТЗ, "ЗагрузкаТЗ", стПараметры);
			
			Если ПустаяСтрока(Результат.ОписаниеОшибки) Тогда
				Сообщить(Формат(ТекущаяДата(), "ДЛФ=DT") + " Не удалось перенести файла ТЗ " + Параметр.ПолноеИмяФайла + ". " + Результат.ОписаниеОшибки);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ИзделиеКомплектИзменено" Тогда
		
		Для каждого х Из Объект.Комплекты Цикл
			
			Если х.Комплект = Параметр Тогда
				
				Обновить(Неопределено);
				Прервать;	
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьСтатусНаСервере(Статус, ОбъектТЗ ,Комментарий)
	
	Если Статус = 2 Тогда //Вернуть в канбан
		УИДКарточка = омКанбанТЗ.ПереместитьРеквизитВВозврат(ОбъектТЗ, Комментарий);	
		Если НЕ ПустаяСтрока(Комментарий) Тогда
			омКанбанТЗ.СоздатьКомментарий(УИДКарточка, Комментарий);	
		КонецЕсли;
	ИначеЕсли Статус = 1 Тогда //Завершить в канбан
		омКанбанТЗ.ПеревестиРеквизитВЗавершенный(ОбъектТЗ, Комментарий);	
	КонецЕсли;
	
КонецПроцедуры // ИзменитьСтатусНаСервере()

&НаКлиенте
Процедура КомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередНачаломИзменения(Элемент, Отказ)
	
	ТД = Элементы.Комплекты.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя = "КомплектыКомплект" Тогда
		Отказ = Истина;
		ПоказатьЗначение(Неопределено, ТД.Комплект);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Объект.ОбъектТЗ) = Тип("СправочникСсылка.Композиции") Тогда
		
		Элементы.ОбъектТЗ.Заголовок = "Композиция";
		
		Элементы.ПланРазработкиВДнях.ТолькоПросмотр = Истина;
		
	Иначе 
		
		Элементы.ГруппаКомплекты.Видимость 	= Ложь;
		Элементы.ОбъектТЗ.Заголовок = "Комплект";
		
	КонецЕсли;
	
	омКомментарииНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКомментарий);
	ДополнительныеПараметры = Неопределено;
	Этаформа.Комментарий_авто = омКомментарииНаСервере.Получить_HTML_комментарий(Объект.Комментарии, , , ДополнительныеПараметры);
	Элементы.ГруппаКомментарий.Заголовок = омКомментарийКлиентСервер.ПолучитьЗаголовокСтраницы(ДополнительныеПараметры);

	стДанные = ПолучитьКонструктораОбъекта(Объект.ОбъектТЗ);
	КонструкторКомпозиции 	= стДанные.Конструктор;
	ВыгруженВPDM			= стДанные.ВыгруженВPDM;
	
	Элементы.ДекорацияОк.Видимость 		= ВыгруженВPDM;
	Элементы.ДекорацияСтоп.Видимость 	= НЕ ВыгруженВPDM;
	Элементы.ОбъектТЗ.ТолькоПросмотр 	= НЕ РольДоступна("Программист");
	
	НаименованиКомплекта = "";
	
	ПутьКФайлуТЗ = омФайлы.ПолучитьПутьКФайлуТЗ(Объект.ОбъектТЗ, Объект.Проект, НаименованиКомплекта, Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГлабольныеСостояниеКомплектаСрезПоследних.ГлобальныйСтатус КАК ГлобальныйСтатус
		|ИЗ
		|	РегистрСведений.ГлабольныеСостояниеКомплекта.СрезПоследних КАК ГлабольныеСостояниеКомплектаСрезПоследних
		|ГДЕ
		|	ГлабольныеСостояниеКомплектаСрезПоследних.ЗадачаДляБлокировки = &ЗадачаДляБлокировки";
	
	Запрос.УстановитьПараметр("ЗадачаДляБлокировки", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Элементы.ДекорацияНаСтопе.Видимость = Ложь;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ГлобальныйСтатус = Перечисления.СтатусыЗадач.ГлобальнаяПриостановкаРаботы Тогда
			ТолькоПросмотр = Истина;	
			Элементы.ДекорацияНаСтопе.Видимость = Истина; 
			Элементы.Группа7.Доступность = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьКомплекты(Композиция)
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(омКанбанДоскиНаСервере.ПолучитьКомплектыКомпозиции(Композиция));
	
КонецФункции // ЗаполнитьКомплекты()

&НаСервереБезКонтекста
Функция ПолучитьКонструктораОбъекта(ОбъектТЗ)
	
	
	стДанные = Новый Структура("ВыгруженВPDM, Конструктор", Ложь);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДатыКомплекта.Код_в_PDM = 0
	|				ИЛИ ДатыКомплекта.Код_в_PDM ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВыгруженВPDM
	|ИЗ
	|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
	|ГДЕ
	|	ДатыКомплекта.Комплект = &ОбъектТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор
	|ИЗ
	|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &ОбъектТЗ) КАК ДанныеКомплектаСрезПоследних";
	
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТЗ);
	
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		стДанные.ВыгруженВPDM = Выборка.ВыгруженВPDM; 
	КонецЦикла;
	
	Выборка = Результат[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		стДанные.Конструктор = Выборка.Конструктор; 
	КонецЦикла;
	
	Возврат стДанные;
		
КонецФункции // ПолучитьКонструктораОбъекта()

&НаСервереБезКонтекста
Процедура НазначитьОсновногоКонструктораНаСервере(КонструкторКомпозиции, мКомплекты)

	Автор = ПараметрыСеанса.ТекущийПользователь;
	ТД = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплектаСрезПоследних.Комплект КАК Комплект,
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоМонтажа КАК ВнешняяДатаНачалоМонтажа,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоПроектирования КАК ВнешняяДатаНачалоПроектирования,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоПроизводства КАК ВнешняяДатаНачалоПроизводства,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоСогласования КАК ВнешняяДатаНачалоСогласования,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеМонтажа КАК ВнешняяДатаОкончаниеМонтажа,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеПроектирования КАК ВнешняяДатаОкончаниеПроектирования,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеПроизводства КАК ВнешняяДатаОкончаниеПроизводства,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеСогласования КАК ВнешняяДатаОкончаниеСогласования,
		|	ДанныеКомплектаСрезПоследних.Приоритет КАК Приоритет
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект В (&мКомплекты)) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("мКомплекты", мКомплекты);
	
	тзКонструкторКомплект = Запрос.Выполнить().Выгрузить();
	
	Для каждого Комплект Из мКомплекты Цикл
		
		НайденаяСтрока = тзКонструкторКомплект.Найти(Комплект, "Комплект");
		
		МенеджерЗаписей = РегистрыСведений.ДанныеКомплекта.СоздатьМенеджерЗаписи();
		
		Если НайденаяСтрока = Неопределено Тогда
			
			ТекущаяСтадия = Неопределено;
			
		ИначеЕсли НайденаяСтрока.Конструктор = КонструкторКомпозиции Тогда
			
			Продолжить;
			
		Иначе	
			
			ЗаполнитьЗначенияСвойств(МенеджерЗаписей, НайденаяСтрока);
			
		КонецЕсли;
		
		МенеджерЗаписей.Период 			= ТД;
		МенеджерЗаписей.Комплект 		= Комплект;
		МенеджерЗаписей.Конструктор 	= КонструкторКомпозиции;
		МенеджерЗаписей.ТекущаяСтадия 	= ТекущаяСтадия;
		МенеджерЗаписей.Автор 			= Автор;
		
		МенеджерЗаписей.Записать();
		
		СтруктуруДляИзмененияИсполнителя = омЗадачаОбщаяНаСервере.ПолучитьСтруктуруДляИзмененияИсполнителя(КонструкторКомпозиции, , Истина);
		//омЗадачаОбщаяНаСервере.ИзменитьИсполнителяЗадачиОбщей(СтруктуруДляИзмененияИсполнителя, Комплект); 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	стДанные = ПолучитьКонструктораОбъекта(Объект.ОбъектТЗ);
	КонструкторКомпозиции 	= стДанные.Конструктор;
	ВыгруженВPDM			= стДанные.ВыгруженВPDM;
	
	Элементы.ДекорацияОк.Видимость 		= ВыгруженВPDM;
	Элементы.ДекорацияСтоп.Видимость 	= НЕ ВыгруженВPDM;
	
	Объект.Комплекты.Очистить();

	Если ТипЗнч(Объект.ОбъектТЗ) = Тип("СправочникСсылка.Композиции") Тогда
		
		мКомплекты = ЗаполнитьКомплекты(Объект.ОбъектТЗ);
		
		Для каждого х Из мКомплекты Цикл
			
			ЗаполнитьЗначенияСвойств(Объект.Комплекты.Добавить(), х);	
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонструкторКомпозицииПриИзменении(Элемент)
	
	мОбъектов = Новый Массив;
	
	Для каждого х Из Объект.Комплекты Цикл
		
		Если НЕ ЗначениеЗаполнено(х.Конструктор) Тогда
		
			мОбъектов.Добавить(х.Комплект);	
		
		КонецЕсли;
		
	КонецЦикла;
	
	Если мОбъектов.Количество() = 0 Тогда
		
		омКонструктор.ИзменитьКонструктораНаСервере(Объект.ОбъектТЗ, КонструкторКомпозиции);
		
	Иначе
		
		мОбъектов.Добавить(Объект.ОбъектТЗ);
		омКонструктор.ИзменитьКонструктораНаСервере(мОбъектов, КонструкторКомпозиции);
		
	КонецЕсли;
	
	Обновить(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПустаяСтрока(ПутьКФайлуТЗ) Тогда
		Элементы.ФормаОткрытьТЗ.Видимость = Ложь;
	Иначе
		
		Файл = Новый Файл(ПутьКФайлуТЗ);
		
		Если Файл.Существует() Тогда
			Элементы.ФормаОткрытьТЗ.Видимость = Истина;
		Иначе
			Элементы.ФормаОткрытьТЗ.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Заголовок = Объект.Наименование;
	
    Элементы.ПланРазработкиВДнях.ТолькоПросмотр = Объект.Выполнена;
	
КонецПроцедуры

#Область Комментарии

&НаКлиенте
Процедура ОбщаяКомандаКомментарий(Команда)
	омКомментарииНаКлиенте.ОбщееДействие(ЭтаФорма, ТекущийЭлемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяКомандаВсеКомментарии(Команда)
	омКомментарииНаКлиенте.ВсеКомментарий(ЭтаФорма, ТекущийЭлемент);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура НормаВремени_ПКДРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Объект.ПланРазработкиВДнях = Объект.ПланРазработкиВДнях + Направление * 0.5;
	
	Если Объект.ПланРазработкиВДнях = 0 Тогда
		Объект.ПланРазработкиВДнях = 0.5;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПриИзменении(Элемент)
	
	ВремяРазработки = Новый Соответствие();
	
	
	Для каждого ТекущийКомплект Из Объект.Комплекты Цикл
		
		НайденКонструктор = Ложь;
		
		Для каждого х Из ВремяРазработки Цикл
		
			Если ТекущийКомплект.Конструктор = х.Ключ Тогда
				ВремяРазработки[х.Ключ]	= х.Значение + ТекущийКомплект.ПланРазработкиВДнях;
				НайденКонструктор 		= Истина;
			КонецЕсли;	
		
		КонецЦикла;
		
		Если НЕ НайденКонструктор Тогда
		
			ВремяРазработки.Вставить(ТекущийКомплект.Конструктор, ТекущийКомплект.ПланРазработкиВДнях);	
		
		КонецЕсли;
		
	КонецЦикла;
	
	Объект.ПланРазработкиВДнях = 0;
	
	Для каждого х Из ВремяРазработки Цикл
		
		Если Объект.ПланРазработкиВДнях < х.Значение Тогда
			Объект.ПланРазработкиВДнях = х.Значение;
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектТЗПриИзменении(Элемент)                     
	Объект.Проект = ПолучитьПроектНаСервере(Объект.ОбъектТЗ);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПроектНаСервере(ОбъектТЗ)

	Возврат ОбъектТЗ.Проект;	

КонецФункции // ПолучитьПроектНаСервере()
